# Logical operations
---
The Logical operators are those that are true or false. They return a true or false values to combine one or more true or false values.

### Connecting with the database

In [ ]:
%load_ext sql
# replace with your own credentials
%sql ibm_db_sa://my-username:my-password@dashdb-txn-sbox-yp-dal09-03.services.dal.bluemix.net:50000/BLUDB

### 1. AND Operator
This operator is used to temporarily show rows only when all the specified conditions are true.

In [2]:
select * from STUDENTS;

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.
Done.
10 rows affected.
Done.

[('United States', 'Marshall', 'Bernadot', 54),
 ('United States', 'Celinda', 'Malkin', 51),
 ('Ukraine', 'Guillermo', 'Furze', 53),
 ('Ukraine', 'Aharon', 'Tunnow', 48),
 ('Russia', 'Bail', 'Goodwin', 46),
 ('Poland', 'Cole', 'Winteringham', 49),
 ('Sweden', 'Emlyn', 'Erricker', 55),
 ('Russia', 'Cathee', 'Sivewright', 49),
 ('Poland', 'Barny', 'Ingerson', 57),
 ('Sweden', 'Sharla', 'Papaccio', 55)]

In [3]:
%sql select * from STUDENTS where country = 'Ukraine' and first_name = 'Aharon'

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Ukraine', 'Aharon', 'Tunnow', 48)]

### 2. OR Operator
This operator is used to temporarily show rows when atleast one of the specified conditions are true.

In [4]:
%sql select * from STUDENTS where country = 'Ukraine' or first_name = 'Aharon'

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Ukraine', 'Guillermo', 'Furze', 53), ('Ukraine', 'Aharon', 'Tunnow', 48)]

### 3. NOT Operator
This operator is used to temporarily show rows only when all the specified condition is false.

In [5]:
%sql select * from STUDENTS where country != 'Ukraine'

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('United States', 'Marshall', 'Bernadot', 54),
 ('United States', 'Celinda', 'Malkin', 51),
 ('Russia', 'Bail', 'Goodwin', 46),
 ('Poland', 'Cole', 'Winteringham', 49),
 ('Sweden', 'Emlyn', 'Erricker', 55),
 ('Russia', 'Cathee', 'Sivewright', 49),
 ('Poland', 'Barny', 'Ingerson', 57),
 ('Sweden', 'Sharla', 'Papaccio', 55)]

### 4. IN Operator
This operator is used to temporarily show rows which are present in the values passed in paranthesis.

In [6]:
%sql select * from STUDENTS where test_score in(57,46)

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Russia', 'Bail', 'Goodwin', 46), ('Poland', 'Barny', 'Ingerson', 57)]

### 5. BETWEEN Operator
This operator is used to temporarily show rows which lies between the two values(included) given.

In [7]:
%sql select * from STUDENTS where test_score between 50 and 55

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('United States', 'Marshall', 'Bernadot', 54),
 ('United States', 'Celinda', 'Malkin', 51),
 ('Ukraine', 'Guillermo', 'Furze', 53),
 ('Sweden', 'Emlyn', 'Erricker', 55),
 ('Sweden', 'Sharla', 'Papaccio', 55)]

### 6. LIKE Operator
Like operator is used to temporarily show all the rows having same alphanumeric in given attribute.

In [8]:
%sql select * from STUDENTS where first_name like  'A%'

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Ukraine', 'Aharon', 'Tunnow', 48)]

In [9]:
%sql select * from STUDENTS where first_name like  'E___n'

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Sweden', 'Emlyn', 'Erricker', 55)]

## Thanks for reading :)
Created by [Tarun Kamboj](https://www.linkedin.com/in/kambojtarun/).